In [1]:
import numpy as np
import pandas as pd

# Context

In [3]:
# Контекст
# The actual Titanic data
df = pd.read_csv('train.csv');
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,C12239,S
1,1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,NaN,S
2,2,0,3,"Owens, Kenneth",male,0.33,1,2,CA 457703,71.29,NaN,S
3,3,0,3,"Kramer, James",male,19.00,0,0,A. 10866,13.04,NaN,S
4,4,1,3,"Bond, Michael",male,25.00,0,0,427635,7.76,NaN,S

In [23]:
print(df.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [27]:
df['Survived'].unique().tolist()

[1, 0]

In [28]:
df['Pclass'].unique().tolist()

[1, 3, 2]

In [29]:
df['Sex'].unique().tolist()

['male', 'female']

In [30]:
df['Embarked'].unique().tolist()

['S', 'C', 'Q', nan]

In [24]:
'''
PassengerId: Passenger Id
Survived: Survival (0 = No, 1 = Yes)
Pclass: Ticket class (1 = 1st, 2 = 2nd, 3 = 3rd)
Name: Passenger name
Sex: Sex (male, female)
Age: Age in years
SibSp: of siblings / spouses aboard the Titanic
Parch: of parents / children aboard the Titanic
Ticket: Ticket number
Fare: Passenger fare
Cabin: Cabin number
Embarked: Port of Embarkation (C = Cherbourg, Q = Queenstown, S = Southampton)
'''

'\nPassengerId: Passenger Id\nSurvived: Survival (0 = No, 1 = Yes)\nPclass: Ticket class (1 = 1st, 2 = 2nd, 3 = 3rd)\nName: Passenger name\nSex: Sex (male, female)\nAge: Age in years\nSibSp: of siblings / spouses aboard the Titanic\nParch: of parents / children aboard the Titanic\nTicket: Ticket number\nFare: Passenger fare\nCabin: Cabin number\nEmbarked: Port of Embarkation (C = Cherbourg, Q = Queenstown, S = Southampton)\n'

# Data quality assessment

In [ ]:
# Оценка качества данных

In [31]:
print(f"Passenger count = {len(df)}");

Passenger count = 100000

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 12 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   PassengerId  100000 non-null  int64
 1   Survived     100000 non-null  int64
 2   Pclass       100000 non-null  int64
 3   Name         100000 non-null  object
 4   Sex          100000 non-null  object
 5   Age          96708 non-null   float64
 6   SibSp        100000 non-null  int64
 7   Parch        100000 non-null  int64
 8   Ticket       95377 non-null   object
 9   Fare         99866 non-null   float64
 10  Cabin        32134 non-null   object
 11  Embarked     99750 non-null   object
dtypes: float64(2), int64(5), object(5)
memory usage: 9.2+ MB

In [ ]:
#несколько колонок содержат null

# Data exploration

In [ ]:
# Исследование данных

# Summary

In [ ]:
# Отчет